Tekla Open API Reference for Tekla Structures 2025
AABB Constructor (Point, Point)
 Instantiates a new axis-aligned 3d bounding box with the given minimum and maximum points.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AABB(
	Point MinPoint,
	Point MaxPoint
)
Public Sub New (
	MinPoint As Point,
	MaxPoint As Point
)
Parameters
MinPoint
Type: Tekla.Structures.Geometry3d.Point
The minimum point to be used.
MaxPoint
Type: Tekla.Structures.Geometry3d.Point
The maximum point to be used.
See Also
Reference
AABB Class
AABB Overload
Tekla.Structures.Geometry3d Namespace